Revit 2027 API
StructuralSection.StructuralSectionGeneralShape Property
 The general type of structural section shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionGeneralShape StructuralSectionGeneralShape { get; }
Public ReadOnly Property StructuralSectionGeneralShape As StructuralSectionGeneralShape
	Get
public:
property StructuralSectionGeneralShape StructuralSectionGeneralShape {
	StructuralSectionGeneralShape get ();
}
member StructuralSectionGeneralShape : StructuralSectionGeneralShape with get
Property Value
StructuralSectionGeneralShape
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace